# IsNullValue Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleFilter..::..IsNullValue Property
ScheduleFilter Class See Also
---
Indicates if the filter has no specified value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsNullValue { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsNullValue As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsNullValue {
	bool get ();
}
```

# See Also
ScheduleFilter Class
Autodesk.Revit.DB Namespace